#### ProjectBrowserOptions Members

---

|  |
| --- |
| ProjectBrowserOptions Class   Methods   Properties   See Also |

The  ProjectBrowserOptions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ProjectBrowserOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

# See Also

ProjectBrowserOptions Class

Autodesk.Revit.UI Namespace